src/Documents/КТУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>КТУ</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСРаботникамиОрганизаций</xr:Item>
				<xr:Item>AccumulationRegister.ВнутрисменноеВремяРаботниковОрганизаций</xr:Item>
				<xr:Item>AccumulationRegister.РабочееВремяРаботниковОрганизаций</xr:Item>
				<xr:Item>CalculationRegister.ОсновныеНачисленияРаботниковОрганизаций</xr:Item>
				<xr:Item>AccumulationRegister.НДФЛСведенияОДоходах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТабНомерС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТабНомерПо</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоЧасам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрКТУПоБригаде</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>10</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРасчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.ОсновныеНачисленияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КТУТаблЧасть</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТарифныйОклад</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КолОтработанногоВремени</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗПЗаФактОтрабВремени</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗПСКТУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Бригадирские</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭкономияФондаЗП</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоплатаПоКТУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КТУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/InformationRegisters/РаботникиОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>РаботникиОрганизаций</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗанимаемыхСтавок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбособленноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗанимаемыхСтавокЗавершения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбособленноеПодразделениеЗавершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодразделениеОрганизацииЗавершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДолжностьЗавершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрафикРаботыЗавершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаИзмененияСостояния</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныИзмененияСостояния</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаИзмененияСостоянияЗавершения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныИзмененияСостояния</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазрядЕТС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоэффициентЕТС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПовышенныйКоэффициентЕТС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииРаботников</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИтоговоеПовышениеПоИнструкции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Временно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТарифнаяСтавкаПервогоРазряда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеСтавкиПервогоРазряда</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УсловияТрудаИзмерение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УсловияТруда</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидДеятельностиИзмерение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсобыеУсловияТруда</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипРаботника</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыРаботников</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СотрудникЗаменяемый</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БезЕТС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкладВВалюте</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДляПечати</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсключитьИзПУ2</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ауМестоРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СЭ_МестаРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВременныйПереводКлимовичи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ОбособленноеПодразделениеРБ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбособленноеПодразделениеРБ1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипРаботникаУдалить</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыРаботников</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьСотрудникЗаменяемый</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/AccumulationRegisters/ВнутрисменноеВремяРаботниковОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ВнутрисменноеВремяРаботниковОрганизаций</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Часов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидИспользованияРабочегоВремени</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторИспользованияРабочегоВремени</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/Enums/ВидыУчетаВремени.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыУчетаВремени</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоДням</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоЧасам</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоВечернимЧасам</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоНочнымЧасам</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоВредность</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неопределен</Name>
					<Comment>Неопределен</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/КТУ/Ext/ObjectModule.bsl
// Возвращает доступные варианты печати документа
//
// Вовращаемое значение:
//	Струткура, каждая строка которой соответствует одному из вариантов печати
//
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	СтруктураМакетов = Новый Структура;
	СтруктураМакетов.Вставить("Макет",	"Макет");
	Возврат СтруктураМакетов;

КонецФункции // ПолучитьСтруктуруПечатныхФорм()

#Если Клиент Тогда

// Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходмое количество копий.
//
//	Название макета печати передается в качестве параметра,
//	по переданному названию находим имя макета в соответствии.
//
// Параметры:
//	НазваниеМакета	- строка, название макета.
//
Функция Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь) Экспорт
	
	ТабДокумент = ПечатьМакета();
	ИмяФормы = "Печать";
	Возврат РаботаСДиалогами.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, РаботаСДиалогами.СформироватьЗаголовокДокумента(ЭтотОбъект,Метаданные().Синоним + ИмяФормы));
	
КонецФункции // Печать()

#КонецЕсли

Функция ПечатьМакета()
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ПолеСлева = 0;
	ТабДокумент.ПолеСправа = 0;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_КТУ_Макет";
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КТУКТУТаблЧасть.НомерСтроки КАК НомерСтроки,
	|	КТУКТУТаблЧасть.Сотрудник,
	|	КТУКТУТаблЧасть.ТарифныйОклад,
	|	КТУКТУТаблЧасть.КолОтработанногоВремени,
	|	КТУКТУТаблЧасть.ЗПЗаФактОтрабВремени,
	|	КТУКТУТаблЧасть.ЗПСКТУ,
	|	КТУКТУТаблЧасть.Бригадирские,
	|	КТУКТУТаблЧасть.ЭкономияФондаЗП,
	|	КТУКТУТаблЧасть.ДоплатаПоКТУ,
	|	КТУКТУТаблЧасть.КТУ,
	|	РаботникиОрганизацийСрезПоследних.Должность
	|ИЗ
	|	Документ.КТУ.КТУТаблЧасть КАК КТУКТУТаблЧасть
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&Период, ) КАК РаботникиОрганизацийСрезПоследних
	|		ПО КТУКТУТаблЧасть.Сотрудник = РаботникиОрганизацийСрезПоследних.Сотрудник
	|ГДЕ
	|	КТУКТУТаблЧасть.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	Запрос.УстановитьПараметр("Период",КонецМесяца(Дата));  
	Запрос.УстановитьПараметр("Ссылка",Ссылка); 
	Макет = ПолучитьМакет("Макет");
	ОбластьМакетаШапка = Макет.ПолучитьОбласть("Заголовок"); // Шапка документа.
	ОбластьМакетаСтрока = Макет.ПолучитьОбласть("СтрокаТЧ");
	ОбластьМакетаИтог = Макет.ПолучитьОбласть("ИтогТЧ");
	ОбластьМакетаШапка.Параметры.ДатаДокумента = Формат(Дата,"ДФ=""дд.ММ.гггг""");
	ОбластьМакетаШапка.Параметры.НомерДокумента = Число(Номер);
	Результат = Запрос.Выполнить().Выбрать();
	если Результат.Следующий() Тогда 
		Норма = Новый Запрос;
		Норма.Текст = 
		 "ВЫБРАТЬ
		 |	СУММА(ГрафикиРаботыПоВидамВремени.ОсновноеЗначение) КАК ОсновноеЗначение,
		 |	СУММА(ГрафикиРаботыПоВидамВремени.ДополнительноеЗначение) КАК ДополнительноеЗначение
		 |ИЗ
		 |	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&Месяц1, ) КАК РаботникиОрганизацийСрезПоследних
		 |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботыПоВидамВремени
		 |		ПО РаботникиОрганизацийСрезПоследних.ГрафикРаботы = ГрафикиРаботыПоВидамВремени.ГрафикРаботы
		 |ГДЕ
		 |	РаботникиОрганизацийСрезПоследних.Сотрудник = &Сотрудник
		 |	и ГрафикиРаботыПоВидамВремени.ВидУчетаВремени = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоДням)
		 |	И ГрафикиРаботыПоВидамВремени.Месяц = &Месяц";
		 Норма.УстановитьПараметр("Месяц",НачалоМесяца(Дата));
		 Норма.УстановитьПараметр("Месяц1",КонецМесяца(Дата));
		 Норма.УстановитьПараметр("Сотрудник", Результат.Сотрудник);
		 РезНорма = Норма.Выполнить().Выбрать();
		 если РезНорма.Следующий() Тогда 
			 //если ПоЧасам Тогда 
			 //	ОбластьМакетаШапка.Параметры.НормаВремени = РезНорма.ДополнительноеЗначение;
			 //иначе
				 ОбластьМакетаШапка.Параметры.НормаВремени = РезНорма.ОсновноеЗначение;
			 //КонецЕсли;
		 КонецЕсли;
		 
	 КонецЕсли;
	    	
	ТабДокумент.Вывести(ОбластьМакетаШапка);
	Результат = Запрос.Выполнить().Выбрать();
	Пока Результат.Следующий() Цикл
		ОбластьМакетаСтрока.Параметры.Заполнить(Результат);
		ОбластьМакетаСтрока.Параметры.Сотрудник = ОбщегоНазначения.ФамилияИнициалыФизЛица(Результат.Сотрудник);
		ОбластьМакетаСтрока.Параметры.СрКТУПоБригаде = СрКТУПоБригаде;
		ТабДокумент.Вывести(ОбластьМакетаСтрока);
	КонецЦикла;
	
	
	ОбластьМакетаИтог.Параметры.ТарифныйОкладИтог = КТУТаблЧасть.Итог("ТарифныйОклад");	
	ОбластьМакетаИтог.Параметры.ЗПЗаФактОтрабВремениИтог = КТУТаблЧасть.Итог("ЗПЗаФактОтрабВремени");
	ОбластьМакетаИтог.Параметры.ЗПСКТУИтог = КТУТаблЧасть.Итог("ЗПСКТУ");
	ОбластьМакетаИтог.Параметры.ЭкономияФондаЗПИтог = КТУТаблЧасть.Итог("ЭкономияФондаЗП");
	ОбластьМакетаИтог.Параметры.ДоплатаПоКТУИтог = КТУТаблЧасть.Итог("ДоплатаПоКТУ");
	ОбластьМакетаИтог.Параметры.БригадирскиеИтог = КТУТаблЧасть.Итог("Бригадирские");

	ТабДокумент.Вывести(ОбластьМакетаИтог);
		

	Возврат ТабДокумент;
	
КонецФункции

Процедура Расчитать() Экспорт 
	//Отказ = Ложь;
	//НаборОсновныеНачисления = РегистрыРасчета.ОсновныеНачисленияРаботниковОрганизаций.СоздатьНаборЗаписей();
	//НаборОсновныеНачисления.Отбор.Регистратор.Значение = Ссылка;
	//ВыборкаПоШапкеДокумента = СформироватьЗапросПоШапке().Выбрать();
	//ВыборкаПоШапкеДокумента.Следующий();
	//ВыборкаПоНачислениям = СформироватьЗапросПоНачисления(ВыборкаПоШапкеДокумента).Выбрать();
	//МассивИндексыСтрокНачисления = Новый Массив();
	//Пока ВыборкаПоНачислениям.Следующий() Цикл 
	//	// проверим очередную строку табличной части
	//	//ПроверитьЗаполнениеСтрокиНачисления(ВыборкаПоШапкеДокумента, ВыборкаПоНачислениям, Отказ, Заголовок, ПолучитьМассивВозможныхНачислений());
	//	Если НЕ Отказ Тогда

	//			ДобавитьСтрокуОсновныхНачислений(ВыборкаПоНачислениям, ВыборкаПоШапкеДокумента, НаборОсновныеНачисления);
	//			МассивИндексыСтрокНачисления.Добавить(ВыборкаПоНачислениям.НомерСтроки-1);
	//	КонецЕсли;
	//КонецЦикла;
	//
	//Если Отказ Тогда
	//	Возврат;
	//КонецЕсли;
	//
	//НаборОсновныеНачисления.Записать();
КонецПроцедуры


Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
	
	//НаборОсновныеНачисления = РегистрыРасчета.ОсновныеНачисленияРаботниковОрганизаций.СоздатьНаборЗаписей();
	//НаборОсновныеНачисления.Отбор.Регистратор.Значение = Ссылка;
	//
	//
	//// Если почасовое отклонение, то записываем движения в регистр ВнутрисменноеВремяРаботниковОрганизаций
	//НаборЗаписейРабочееВремя = РегистрыНакопления.ВнутрисменноеВремяРаботниковОрганизаций.СоздатьНаборЗаписей();
	//НаборЗаписейРабочееВремя.Отбор.Регистратор.Значение = Ссылка;
	
	// Получим реквизиты шапки из запроса
	ВыборкаПоШапкеДокумента = СформироватьЗапросПоШапке().Выбрать();
	Движения.ОсновныеНачисленияРаботниковОрганизаций.Записывать = Истина;
	Если ВыборкаПоШапкеДокумента.Следующий() Тогда
		
		//Надо позвать проверку заполнения реквизитов шапки
		ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ, Заголовок);
		
		// Движения стоит добавлять, если в проведении еще не отказано (отказ =ложь)
		Если НЕ Отказ Тогда
			
			////////////////////////////////////////////////////////////////////////
			// основные Начисления
			
			Движения.ОсновныеНачисленияРаботниковОрганизаций.мВыполнятьВспомогательныеРасчеты = Истина;
			
			// получим реквизиты табличной части
			ВыборкаПоНачислениям = СформироватьЗапросПоНачисления(ВыборкаПоШапкеДокумента).Выбрать();
			
			Пока ВыборкаПоНачислениям.Следующий() Цикл 
				
				Если НЕ Отказ Тогда
					// Заполним записи в наборах записей регистров
					ДобавитьСтрокуОсновныхНачислений(ВыборкаПоНачислениям, ВыборкаПоШапкеДокумента, Движения.ОсновныеНачисленияРаботниковОрганизаций);
					ДобавитьСтрокуРабочегоВремени(ВыборкаПоШапкеДокумента, ВыборкаПоНачислениям, Движения.ВнутрисменноеВремяРаботниковОрганизаций);
				КонецЕсли;
			КонецЦикла;
			//ПроведениеРасчетов.РассчитатьЗаписиРегистраРасчета("ОсновныеНачисленияРаботниковОрганизаций", Движения.ОсновныеНачисленияРаботниковОрганизаций, Неопределено, , ВыборкаПоШапкеДокумента.Организация, , КТУТаблЧасть);
			// запишем результат расчета для расчета доп. начислений
			
			
			// выполним удаление перерасчетов исправленного документа
			
			Для Каждого Набор Из Движения Цикл
				ТипНабораЗаписей = ТипЗнч(Набор);
				Если ТипНабораЗаписей = Тип("РегистрРасчетаНаборЗаписей.ОсновныеНачисленияРаботниковОрганизаций") 
					Или ТипНабораЗаписей = Тип("РегистрРасчетаНаборЗаписей.ДополнительныеНачисленияРаботниковОрганизаций") Тогда
					Набор.Записать();
				КонецЕсли;
			КонецЦикла;
			ПроведениеРасчетов.ОбработатьТаблицуПерерасчетов(Ссылка);
			
			//Движения.ОсновныеНачисленияРаботниковОрганизаций.Записать();
			////////////////////////////////////////////////////////////////////////
			// доходы НДФЛ
			
			// сформируем доходы НДФЛ по начислениям документа
			СформироватьДоходыПоКодамНДФЛ(ВыборкаПоШапкеДокумента, Движения.НДФЛСведенияОДоходах);
			
			////////////////////////////////////////////////////////////////////////
			// взаиморасчеты с работниками
			
			// сформируем начисления к выплате по начислениям документа
			СформироватьВзаиморасчетыСРаботниками(ВыборкаПоШапкеДокумента, Движения.ВзаиморасчетыСРаботникамиОрганизаций);
						
			
		КонецЕсли;
	КонецЕсли;
	
	
КонецПроцедуры

Функция СформироватьЗапросПоШапке()
	
	Запрос = Новый Запрос;
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка",			Ссылка);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КТУ.Ссылка,
	|	КТУ.ПометкаУдаления,
	|	КТУ.Номер,
	|	КТУ.Дата,
	|	КТУ.Проведен,
	|	КТУ.Ответственный,
	|	КТУ.Организация,
	|	КТУ.ПодразделениеОрганизации,
	|	КТУ.ТабНомерС,
	|	КТУ.ТабНомерПо,
	|	КТУ.Комментарий,
	|	КТУ.ПоЧасам,
	|	КТУ.СрКТУПоБригаде,
	|	КТУ.ВидРасчета
	|ИЗ
	|	Документ.КТУ КАК КТУ
	|ГДЕ
	|	КТУ.Ссылка = &ДокументСсылка";
	
	Возврат Запрос.Выполнить();
	
КонецФункции // СформироватьЗапросПоШапке()

Процедура ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ, Заголовок = "")
	
	//  Организация
	Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.Организация) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указана организация, по которой выполняются начисления!", Отказ, Заголовок);
	КонецЕсли;
	
	
КонецПроцедуры // ПроверитьЗаполнениеШапки()

Функция СформироватьЗапросПоНачисления(ВыборкаПоШапкеДокумента)
	
	Запрос = Новый Запрос;	
	МассивВидовВремени = Новый СписокЗначений;
	МассивВидовВремени.Добавить(Перечисления.ВидыВремени.ЧасовоеНеотработанное);
	МассивВидовВремени.Добавить(Перечисления.ВидыВремени.ЧасовоеОтработанноеВПределахНормы);
	Запрос.УстановитьПараметр("ПочасовоеНачисление",МассивВидовВремени);

	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка",		Ссылка);
	Запрос.УстановитьПараметр("Период",		КонецМесяца(Дата));
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КТУКТУТаблЧасть.Ссылка,
	|	КТУКТУТаблЧасть.НомерСтроки,
	|	КТУКТУТаблЧасть.Сотрудник,
	|	КТУКТУТаблЧасть.ТарифныйОклад,
	|	КТУКТУТаблЧасть.КолОтработанногоВремени,
	|	КТУКТУТаблЧасть.ЗПЗаФактОтрабВремени,
	|	КТУКТУТаблЧасть.ЗПСКТУ,
	|	КТУКТУТаблЧасть.Бригадирские,
	|	КТУКТУТаблЧасть.ЭкономияФондаЗП,
	|	КТУКТУТаблЧасть.ДоплатаПоКТУ,
	|	КТУКТУТаблЧасть.КТУ,
	|	РаботникиОрганизацийСрезПоследних.ГрафикРаботы,
	|	РаботникиОрганизацийСрезПоследних.Должность,
	|	РаботникиОрганизацийСрезПоследних.Категория,
	|	КТУКТУТаблЧасть.Ссылка.ВидРасчета,
	|	КТУКТУТаблЧасть.Сотрудник.Физлицо КАК ФизЛицо,
	|	ВЫБОР
	|		КОГДА КТУКТУТаблЧасть.Ссылка.ВидРасчета В (&ПочасовоеНачисление)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЯвляетсяПочасовымОтклонением
	|ИЗ
	|	Документ.КТУ.КТУТаблЧасть КАК КТУКТУТаблЧасть
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&Период, ) КАК РаботникиОрганизацийСрезПоследних
	|		ПО КТУКТУТаблЧасть.Сотрудник = РаботникиОрганизацийСрезПоследних.Сотрудник
	|ГДЕ
	|	КТУКТУТаблЧасть.Ссылка = &ДокументСсылка";
	Возврат Запрос.Выполнить();
КонецФункции

Процедура ДобавитьСтрокуОсновныхНачислений(ВыборкаПоСтрокамДокумента, ВыборкаПоШапкеДокумента, НаборЗаписей)
	
	Движение = НаборЗаписей.Добавить();
	
	// Свойства
	Движение.ПериодРегистрации				= НачалоМесяца(ВыборкаПоШапкеДокумента.Дата);
	Движение.ПериодДействияНачало			= НачалоМесяца(ВыборкаПоШапкеДокумента.Дата);
	Движение.ПериодДействияКонец			= КонецМесяца(ВыборкаПоШапкеДокумента.Дата);
	Движение.БазовыйПериодНачало			= НачалоМесяца(ВыборкаПоШапкеДокумента.Дата);
	Движение.БазовыйПериодКонец				= КонецМесяца(ВыборкаПоШапкеДокумента.Дата);
	Движение.ВидРасчета						= ВыборкаПоШапкеДокумента.ВидРасчета;
	//Движение.Сторно							= ВыборкаПоСтрокамДокумента.Сторно;
	
	// Измерения
	Движение.Сотрудник						= ВыборкаПоСтрокамДокумента.Сотрудник;
	Движение.ФизЛицо						= ВыборкаПоСтрокамДокумента.ФизЛицо;
	Движение.Организация					= ВыборкаПоШапкеДокумента.Организация;
	
	// Ресурсы
	Движение.Результат						= ВыборкаПоСтрокамДокумента.ДоплатаПоКТУ;
	
	// Реквизиты
	Движение.ГрафикРаботы					= ВыборкаПоСтрокамДокумента.ГрафикРаботы;
	Движение.ОбособленноеПодразделение		= ВыборкаПоШапкеДокумента.Организация;
	//Движение.Показатель1					= ВыборкаПоСтрокамДокумента.Показатель1;
	//Движение.Показатель2					= ВыборкаПоСтрокамДокумента.Показатель2;
	//Движение.Показатель3					= ВыборкаПоСтрокамДокумента.Показатель3;
	//Движение.Показатель4					= ВыборкаПоСтрокамДокумента.Показатель4;	
	//Движение.Показатель5					= ВыборкаПоСтрокамДокумента.Показатель5;
	//Движение.Показатель6					= ВыборкаПоСтрокамДокумента.Показатель6;	
	Движение.ВидУчетаВремени				= ?(ПоЧасам,Перечисления.ВидыУчетаВремени.ПоЧасам,Перечисления.ВидыУчетаВремени.ПоДням);
	Движение.ПодразделениеОрганизации		= ВыборкаПоШапкеДокумента.ПодразделениеОрганизации;
	Движение.ДатаНачалаСобытия				= НачалоМесяца(ВыборкаПоШапкеДокумента.Дата);
	если ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.Бригадирские) и ЗначениеЗаполнено(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.НайтиПоНаименованию("Бригадирство")) Тогда 
		Движение = НаборЗаписей.Добавить();
	
	// Свойства
	Движение.ПериодРегистрации				= НачалоМесяца(ВыборкаПоШапкеДокумента.Дата);
	Движение.ПериодДействияНачало			= НачалоМесяца(ВыборкаПоШапкеДокумента.Дата);
	Движение.ПериодДействияКонец			= КонецМесяца(ВыборкаПоШапкеДокумента.Дата);
	Движение.БазовыйПериодНачало			= НачалоМесяца(ВыборкаПоШапкеДокумента.Дата);
	Движение.БазовыйПериодКонец				= КонецМесяца(ВыборкаПоШапкеДокумента.Дата);
	Движение.ВидРасчета						= ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.НайтиПоНаименованию("Бригадирство");
	//Движение.Сторно							= ВыборкаПоСтрокамДокумента.Сторно;
	
	// Измерения
	Движение.Сотрудник						= ВыборкаПоСтрокамДокумента.Сотрудник;
	Движение.ФизЛицо						= ВыборкаПоСтрокамДокумента.ФизЛицо;
	Движение.Организация					= ВыборкаПоШапкеДокумента.Организация;
	
	// Ресурсы
	Движение.Результат						= ВыборкаПоСтрокамДокумента.Бригадирские;
	
	// Реквизиты
	Движение.ГрафикРаботы					= ВыборкаПоСтрокамДокумента.ГрафикРаботы;
	Движение.ОбособленноеПодразделение		= ВыборкаПоШапкеДокумента.Организация;
	//Движение.Показатель1					= ВыборкаПоСтрокамДокумента.Показатель1;
	//Движение.Показатель2					= ВыборкаПоСтрокамДокумента.Показатель2;
	//Движение.Показатель3					= ВыборкаПоСтрокамДокумента.Показатель3;
	//Движение.Показатель4					= ВыборкаПоСтрокамДокумента.Показатель4;	
	//Движение.Показатель5					= ВыборкаПоСтрокамДокумента.Показатель5;
	//Движение.Показатель6					= ВыборкаПоСтрокамДокумента.Показатель6;	
	Движение.ВидУчетаВремени				= ?(ПоЧасам,Перечисления.ВидыУчетаВремени.ПоЧасам,Перечисления.ВидыУчетаВремени.ПоДням);
	Движение.ПодразделениеОрганизации		= ВыборкаПоШапкеДокумента.ПодразделениеОрганизации;
	Движение.ДатаНачалаСобытия				= НачалоМесяца(ВыборкаПоШапкеДокумента.Дата);
	КонецЕсли;
	
КонецПроцедуры // ДобавитьСтрокуОсновныхНачислений()

Процедура ДобавитьСтрокуРабочегоВремени(ВыборкаПоШапкеДокумента, ВыборкаПоНачислениям, НаборЗаписей)
	
	Если ВыборкаПоНачислениям.ЯвляетсяПочасовымОтклонением Тогда
		Движение = НаборЗаписей.Добавить();
		
		// Свойства
		Движение.Период = НачалоМесяца(ВыборкаПоШапкеДокумента.Дата);
		
		// Измерения
		Движение.Сотрудник							= ВыборкаПоНачислениям.Сотрудник;
		Движение.Организация						= ВыборкаПоШапкеДокумента.Организация;
		//Движение.ВидИспользованияРабочегоВремени	= ВыборкаПоНачислениям.ВидИспользованияРабочегоВремени;
		
		// Ресурсы
		//Движение.Часов								= ВыборкаПоНачислениям.ОплачиватьЧасов;
	КонецЕсли;
	
КонецПроцедуры // ДобавитьСтрокуРабочегоВремени()

// получает доходы НДФЛ по табличным частям с доходами
// Параметры:
//		ВыборкаПоШапкеДокумента - спозиционированная выборка по шапке документа
//		
Процедура СформироватьДоходыПоКодамНДФЛ(ВыборкаПоШапкеДокумента, НаборЗаписей)
	
	Запрос = Новый Запрос;
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("парамСсылка",			Ссылка);
	Запрос.УстановитьПараметр("ДатаНалоговогоПериода", КонецГода(Дата));
	КодОплатыТрудаПоНДФЛ = Новый Массив;
	КодОплатыТрудаПоНДФЛ.Добавить(Справочники.ДоходыНДФЛ.КодДоходаПоУмолчанию);
	//КодОплатыТрудаПоНДФЛ.Добавить(Справочники.ДоходыНДФЛ.Код2012);
	Запрос.УстановитьПараметр("КодОплатыТрудаПоНДФЛ", КодОплатыТрудаПоНДФЛ);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Доходы.Физлицо,
	|	Доходы.КодДохода,
	|	Доходы.Период,
	|	Доходы.СуммаДохода,
	|	Доходы.СуммаВычета,
	|	Доходы.ПодразделениеОрганизации
	|ИЗ
	|	(ВЫБРАТЬ
	|		КТУКТУТаблЧасть.Сотрудник.Физлицо КАК Физлицо,
	|		КТУКТУТаблЧасть.Ссылка.ВидРасчета.КодДоходаНДФЛ КАК КодДохода,
	|		НАЧАЛОПЕРИОДА(КТУКТУТаблЧасть.Ссылка.Дата, ДЕНЬ) КАК Период,
	|		КТУКТУТаблЧасть.ДоплатаПоКТУ КАК СуммаДохода,
	|		0 КАК СуммаВычета,
	|		КТУКТУТаблЧасть.Ссылка.ПодразделениеОрганизации КАК ПодразделениеОрганизации
	|	ИЗ
	|		Документ.КТУ.КТУТаблЧасть КАК КТУКТУТаблЧасть
	|	ГДЕ
	|		КТУКТУТаблЧасть.Ссылка = &парамСсылка
	|		И КТУКТУТаблЧасть.Ссылка.ВидРасчета.КодДоходаНДФЛ <> ЗНАЧЕНИЕ(Справочник.ДоходыНДФЛ.ПустаяСсылка)
	|		И КТУКТУТаблЧасть.ДоплатаПоКТУ <> 0) КАК Доходы";
	
	ДоходыПоКодам = Запрос.Выполнить().Выбрать();
	// сформируем движения НДФЛСведенияОДоходах
	Пока ДоходыПоКодам.Следующий() Цикл
		Движение = НаборЗаписей.Добавить();
		
		// свойства
		Движение.Период						= ДоходыПоКодам.Период;
		
		// измерения 
		Движение.Организация				= ВыборкаПоШапкеДокумента.Организация;
		Движение.Физлицо					= ДоходыПоКодам.Физлицо;
		Движение.КодДохода					= ДоходыПоКодам.КодДохода;
		Движение.ПериодРегистрации			= НачалоМесяца(Дата);
		
		// ресурсы
		Движение.СуммаДохода				= ДоходыПоКодам.СуммаДохода;
		Движение.СуммаВычета				= ДоходыПоКодам.СуммаВычета;
		
		// реквизиты
		//Движение.КодВычета					= ДоходыПоКодам.КодВычета;
		Движение.ИсчисленоИзЗарплаты		= Истина;
		Движение.ПодразделениеОрганизации	= ДоходыПоКодам.ПодразделениеОрганизации;
	КонецЦикла;
	НаборЗаписей.Записать();

КонецПроцедуры // СформироватьДоходыПоКодамНДФЛ()

// Вычисляет разницу между начислениями и удержаниями работника и формирует
// движения по взаиморасчетам с работниками
//
// Параметры:
//	ВыборкаПоШапкеДокумента	- спозиционированная выборка по шапке документа
//	НаборЗаписей			- набор записей 
//	Перерасчет				- признак проведения перерасчетов, по умолчанию - Ложь
//	Физлица					- список физлиц, по которым производится расчет, по умолчанию - отсутствует
//
// Возвращаемое значение:
//	Нет.
//	
Процедура СформироватьВзаиморасчетыСРаботниками(ВыборкаПоШапкеДокумента, НаборЗаписей,Перерасчет = Ложь, Физлица = Неопределено)
	
	Если Перерасчет Тогда
		Если Физлица = Неопределено Тогда
			// таблица ФизлицаДляПерерасчета
			// Список физлиц по которым необходимо выполнить перерасчет
			// Поля:
			//		ФизЛицо
			// Описание:
			// Получает список неповторяющихся физлиц по которым есть записи
			// перерасчета в одной из таблиц перерасчета - по основным или дополнительным начислениям
			//
			ФизлицаДляПерерасчетаТекст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Перерасчет.ФизЛицо
			|ИЗ
			|	(ВЫБРАТЬ
			|		Перерасчет.ФизЛицо
			|	ИЗ
			|		РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций.ПерерасчетОсновныхНачислений КАК Перерасчет
			|	
			|	ГДЕ
			|		Перерасчет.ОбъектПерерасчета = &парамСсылка
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		Перерасчет.ФизЛицо
			|	ИЗ
			|		РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций.ПерерасчетДополнительныхНачислений КАК Перерасчет
			|	
			|	ГДЕ
			|		Перерасчет.ОбъектПерерасчета = &парамСсылка) КАК Перерасчет";
			
			// НачисленияРаботников
			//	Поля:
			//		Физлицо
			//		СуммаДохода - сумма "к выплате" - увличение состояния взаиморасчета с работником
			//
			
			НачисленияРаботниковТекст = 
			"ВЫБРАТЬ
			|	Доходы.Физлицо,
			|	СУММА(Доходы.Результат) КАК Результат,
			|	Доходы.Бригадирские
			|ИЗ
			|	(ВЫБРАТЬ
			|		КТУКТУТаблЧасть.Сотрудник.Физлицо КАК Физлицо,
			|		КТУКТУТаблЧасть.ДоплатаПоКТУ КАК Результат,
			|		КТУКТУТаблЧасть.Бригадирские КАК Бригадирские

			|	ИЗ
			|		Документ.КТУ.КТУТаблЧасть КАК КТУКТУТаблЧасть
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
			|				Перерасчет.ФизЛицо КАК ФизЛицо
			|			ИЗ
			|				("+ФизлицаДляПерерасчетаТекст+") КАК ФизлицаДляПерерасчета
			|			ПО (ФизлицаДляПерерасчета.ФизЛицо = КТУКТУТаблЧасть.Сотрудник.Физлицо)
			|	ГДЕ
			|		КТУКТУТаблЧасть.Ссылка = &парамСсылка
			|		И КТУКТУТаблЧасть.ДоплатаПоКТУ <> 0
			|		И НЕ КТУКТУТаблЧасть.Ссылка.ВидРасчета.ЯвляетсяДоходомВНатуральнойФорме) КАК Доходы
			|
			|СГРУППИРОВАТЬ ПО
			|	Доходы.Физлицо
			|	Доходы.Бригадирские";
			
			Запрос = Новый Запрос(НачисленияРаботниковТекст);
		Иначе
			
			НачисленияРаботниковТекст = 
			"ВЫБРАТЬ
			|	Доходы.Физлицо,
			|	СУММА(Доходы.Результат) КАК Результат,
			|	Доходы.Бригадирские
			|ИЗ
			|	(ВЫБРАТЬ
			|		КТУКТУТаблЧасть.Сотрудник.Физлицо КАК Физлицо,
			|		КТУКТУТаблЧасть.ДоплатаПоКТУ КАК Результат,
			|		КТУКТУТаблЧасть.Бригадирские КАК Бригадирские
			|	ИЗ
			|		Документ.КТУ.КТУТаблЧасть КАК КТУКТУТаблЧасть
			|	ГДЕ
			|		КТУКТУТаблЧасть.Сотрудник.Физлицо В(&парамФизлица)
			|		И КТУКТУТаблЧасть.Ссылка = &парамСсылка
			|		И КТУКТУТаблЧасть.ДоплатаПоКТУ <> 0
			|		И НЕ КТУКТУТаблЧасть.Ссылка.ВидРасчета.ЯвляетсяДоходомВНатуральнойФорме) КАК Доходы
			|
			|СГРУППИРОВАТЬ ПО
			|	Доходы.Физлицо,
			|	Доходы.Бригадирские";
			
			Запрос = Новый Запрос(НачисленияРаботниковТекст);
			Запрос.УстановитьПараметр("парамФизлица", Физлица);
			
		КонецЕсли;
	Иначе
		НачисленияРаботниковТекст = 
		"ВЫБРАТЬ
		|	Доходы.Физлицо,
		|	СУММА(Доходы.Результат) КАК СуммаДохода,
		|	Доходы.Бригадирские
		|ИЗ
		|	(ВЫБРАТЬ
		|		КТУКТУТаблЧасть.Сотрудник.Физлицо КАК Физлицо,
		|		КТУКТУТаблЧасть.ДоплатаПоКТУ КАК Результат,
		|		КТУКТУТаблЧасть.Бригадирские КАК Бригадирские
		|	ИЗ
		|		Документ.КТУ.КТУТаблЧасть КАК КТУКТУТаблЧасть
		|	ГДЕ
		|		КТУКТУТаблЧасть.Ссылка = &парамСсылка
		|		И КТУКТУТаблЧасть.ДоплатаПоКТУ <> 0
		|		И НЕ КТУКТУТаблЧасть.Ссылка.ВидРасчета.ЯвляетсяДоходомВНатуральнойФорме) КАК Доходы
		|
		|СГРУППИРОВАТЬ ПО
		|	Доходы.Физлицо,
		|	Доходы.Бригадирские";
	КонецЕсли;	
	Запрос = Новый Запрос(НачисленияРаботниковТекст);
	
	
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("парамСсылка" , Ссылка);
	
	Доходы = Запрос.Выполнить().Выбрать();
	// сформируем движения ВзаиморасчетыСРаботникамиОрганизаций
	Пока Доходы.Следующий() Цикл
		Движение = НаборЗаписей.Добавить();
		
		// свойства
		Движение.Период					= КонецМесяца(Дата);
		Движение.ВидДвижения			= ВидДвиженияНакопления.Приход;
		
		// измерения 
		Движение.Физлицо				= Доходы.Физлицо;
		Движение.Организация			= Организация;
		
		// ресурсы
		Движение.СуммаВзаиморасчетов	= Доходы.СуммаДохода;
		если ЗначениеЗаполнено(Доходы.Бригадирские) и ЗначениеЗаполнено(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.НайтиПоНаименованию("Бригадирство")) Тогда 
			Движение = НаборЗаписей.Добавить();
			
			// свойства
			Движение.Период					= КонецМесяца(Дата);
			Движение.ВидДвижения			= ВидДвиженияНакопления.Приход;
			
			// измерения 
			Движение.Физлицо				= Доходы.Физлицо;
			Движение.Организация			= Организация;
			
			// ресурсы
			Движение.СуммаВзаиморасчетов	= Доходы.Бригадирские;
			
		КонецЕсли;
		
		
	КонецЦикла;
	НаборЗаписей.Записать();
	
КонецПроцедуры // СформироватьВзаиморасчетыСРаботниками()
